frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/eic.h
/**
 * \file
 *
 * \brief Component description for EIC
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_EIC_COMPONENT_
#define _SAM4L_EIC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR EIC */
/* ========================================================================== */
/** \addtogroup SAM4L_EIC External Interrupt Controller */
/*@{*/

#define EIC_I7529
#define REV_EIC                     0x302

/* -------- EIC_IER : (EIC Offset: 0x000) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NMI:1;            /*!< bit:      0  External Non Maskable CPU interrupt */
    uint32_t INT1:1;           /*!< bit:      1  External Interrupt 1               */
    uint32_t INT2:1;           /*!< bit:      2  External Interrupt 2               */
    uint32_t INT3:1;           /*!< bit:      3  External Interrupt 3               */
    uint32_t INT4:1;           /*!< bit:      4  External Interrupt 4               */
    uint32_t INT5:1;           /*!< bit:      5  External Interrupt 5               */
    uint32_t INT6:1;           /*!< bit:      6  External Interrupt 6               */
    uint32_t INT7:1;           /*!< bit:      7  External Interrupt 7               */
    uint32_t INT8:1;           /*!< bit:      8  External Interrupt 8               */
    uint32_t INT9:1;           /*!< bit:      9  External Interrupt 9               */
    uint32_t INT10:1;          /*!< bit:     10  External Interrupt 10              */
    uint32_t INT11:1;          /*!< bit:     11  External Interrupt 11              */
    uint32_t INT12:1;          /*!< bit:     12  External Interrupt 12              */
    uint32_t INT13:1;          /*!< bit:     13  External Interrupt 13              */
    uint32_t INT14:1;          /*!< bit:     14  External Interrupt 14              */
    uint32_t INT15:1;          /*!< bit:     15  External Interrupt 15              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} EIC_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_IER_OFFSET              0x000        /**< \brief (EIC_IER offset) Interrupt Enable Register */
#define EIC_IER_RESETVALUE          _U(0x00000000); /**< \brief (EIC_IER reset_value) Interrupt Enable Register */

#define EIC_IER_NMI_Pos             0            /**< \brief (EIC_IER) External Non Maskable CPU interrupt */
#define EIC_IER_NMI                 (_U(0x1) << EIC_IER_NMI_Pos)
#define EIC_IER_INT1_Pos            1            /**< \brief (EIC_IER) External Interrupt 1 */
#define EIC_IER_INT1                (_U(0x1) << EIC_IER_INT1_Pos)
#define   EIC_IER_INT1_0_Val              _U(0x0)   /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT1_1_Val              _U(0x1)   /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT1_0              (EIC_IER_INT1_0_Val            << EIC_IER_INT1_Pos)
#define EIC_IER_INT1_1              (EIC_IER_INT1_1_Val            << EIC_IER_INT1_Pos)
#define EIC_IER_INT2_Pos            2            /**< \brief (EIC_IER) External Interrupt 2 */
#define EIC_IER_INT2                (_U(0x1) << EIC_IER_INT2_Pos)
#define   EIC_IER_INT2_0_Val              _U(0x0)   /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT2_1_Val              _U(0x1)   /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT2_0              (EIC_IER_INT2_0_Val            << EIC_IER_INT2_Pos)
#define EIC_IER_INT2_1              (EIC_IER_INT2_1_Val            << EIC_IER_INT2_Pos)
#define EIC_IER_INT3_Pos            3            /**< \brief (EIC_IER) External Interrupt 3 */
#define EIC_IER_INT3                (_U(0x1) << EIC_IER_INT3_Pos)
#define   EIC_IER_INT3_0_Val              _U(0x0)   /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT3_1_Val              _U(0x1)   /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT3_0              (EIC_IER_INT3_0_Val            << EIC_IER_INT3_Pos)
#define EIC_IER_INT3_1              (EIC_IER_INT3_1_Val            << EIC_IER_INT3_Pos)
#define EIC_IER_INT4_Pos            4            /**< \brief (EIC_IER) External Interrupt 4 */
#define EIC_IER_INT4                (_U(0x1) << EIC_IER_INT4_Pos)
#define   EIC_IER_INT4_0_Val              _U(0x0)   /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT4_1_Val              _U(0x1)   /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT4_0              (EIC_IER_INT4_0_Val            << EIC_IER_INT4_Pos)
#define EIC_IER_INT4_1              (EIC_IER_INT4_1_Val            << EIC_IER_INT4_Pos)
#define EIC_IER_INT5_Pos            5            /**< \brief (EIC_IER) External Interrupt 5 */
#define EIC_IER_INT5                (_U(0x1) << EIC_IER_INT5_Pos)
#define EIC_IER_INT6_Pos            6            /**< \brief (EIC_IER) External Interrupt 6 */
#define EIC_IER_INT6                (_U(0x1) << EIC_IER_INT6_Pos)
#define EIC_IER_INT7_Pos            7            /**< \brief (EIC_IER) External Interrupt 7 */
#define EIC_IER_INT7                (_U(0x1) << EIC_IER_INT7_Pos)
#define EIC_IER_INT8_Pos            8            /**< \brief (EIC_IER) External Interrupt 8 */
#define EIC_IER_INT8                (_U(0x1) << EIC_IER_INT8_Pos)
#define EIC_IER_INT9_Pos            9            /**< \brief (EIC_IER) External Interrupt 9 */
#define EIC_IER_INT9                (_U(0x1) << EIC_IER_INT9_Pos)
#define EIC_IER_INT10_Pos           10           /**< \brief (EIC_IER) External Interrupt 10 */
#define EIC_IER_INT10               (_U(0x1) << EIC_IER_INT10_Pos)
#define EIC_IER_INT11_Pos           11           /**< \brief (EIC_IER) External Interrupt 11 */
#define EIC_IER_INT11               (_U(0x1) << EIC_IER_INT11_Pos)
#define EIC_IER_INT12_Pos           12           /**< \brief (EIC_IER) External Interrupt 12 */
#define EIC_IER_INT12               (_U(0x1) << EIC_IER_INT12_Pos)
#define EIC_IER_INT13_Pos           13           /**< \brief (EIC_IER) External Interrupt 13 */
#define EIC_IER_INT13               (_U(0x1) << EIC_IER_INT13_Pos)
#define EIC_IER_INT14_Pos           14           /**< \brief (EIC_IER) External Interrupt 14 */
#define EIC_IER_INT14               (_U(0x1) << EIC_IER_INT14_Pos)
#define EIC_IER_INT15_Pos           15           /**< \brief (EIC_IER) External Interrupt 15 */
#define EIC_IER_INT15               (_U(0x1) << EIC_IER_INT15_Pos)
#define EIC_IER_MASK                _U(0x0000FFFF) /**< \brief (EIC_IER) MASK Register */

/* -------- EIC_IDR : (EIC Offset: 0x004) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NMI:1;            /*!< bit:      0  External Non Maskable CPU interrupt */
    uint32_t INT1:1;           /*!< bit:      1  External Interrupt 1               */
    uint32_t INT2:1;           /*!< bit:      2  External Interrupt 2               */
    uint32_t INT3:1;           /*!< bit:      3  External Interrupt 3               */
    uint32_t INT4:1;           /*!< bit:      4  External Interrupt 4               */
    uint32_t INT5:1;           /*!< bit:      5  External Interrupt 5               */
    uint32_t INT6:1;           /*!< bit:      6  External Interrupt 6               */
    uint32_t INT7:1;           /*!< bit:      7  External Interrupt 7               */
    uint32_t INT8:1;           /*!< bit:      8  External Interrupt 8               */
    uint32_t INT9:1;           /*!< bit:      9  External Interrupt 9               */
    uint32_t INT10:1;          /*!< bit:     10  External Interrupt 10              */
    uint32_t INT11:1;          /*!< bit:     11  External Interrupt 11              */
    uint32_t INT12:1;          /*!< bit:     12  External Interrupt 12              */
    uint32_t INT13:1;          /*!< bit:     13  External Interrupt 13              */
    uint32_t INT14:1;          /*!< bit:     14  External Interrupt 14              */
    uint32_t INT15:1;          /*!< bit:     15  External Interrupt 15              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} EIC_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_IDR_OFFSET              0x004        /**< \brief (EIC_IDR offset) Interrupt Disable Register */
#define EIC_IDR_RESETVALUE          _U(0x00000000); /**< \brief (EIC_IDR reset_value) Interrupt Disable Register */

#define EIC_IDR_NMI_Pos             0            /**< \brief (EIC_IDR) External Non Maskable CPU interrupt */
#define EIC_IDR_NMI                 (_U(0x1) << EIC_IDR_NMI_Pos)
#define EIC_IDR_INT1_Pos            1            /**< \brief (EIC_IDR) External Interrupt 1 */
#define EIC_IDR_INT1                (_U(0x1) << EIC_IDR_INT1_Pos)
#define   EIC_IDR_INT1_0_Val              _U(0x0)   /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT1_1_Val              _U(0x1)   /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT1_0              (EIC_IDR_INT1_0_Val            << EIC_IDR_INT1_Pos)
#define EIC_IDR_INT1_1              (EIC_IDR_INT1_1_Val            << EIC_IDR_INT1_Pos)
#define EIC_IDR_INT2_Pos            2            /**< \brief (EIC_IDR) External Interrupt 2 */
#define EIC_IDR_INT2                (_U(0x1) << EIC_IDR_INT2_Pos)
#define   EIC_IDR_INT2_0_Val              _U(0x0)   /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT2_1_Val              _U(0x1)   /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT2_0              (EIC_IDR_INT2_0_Val            << EIC_IDR_INT2_Pos)
#define EIC_IDR_INT2_1              (EIC_IDR_INT2_1_Val            << EIC_IDR_INT2_Pos)
#define EIC_IDR_INT3_Pos            3            /**< \brief (EIC_IDR) External Interrupt 3 */
#define EIC_IDR_INT3                (_U(0x1) << EIC_IDR_INT3_Pos)
#define   EIC_IDR_INT3_0_Val              _U(0x0)   /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT3_1_Val              _U(0x1)   /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT3_0              (EIC_IDR_INT3_0_Val            << EIC_IDR_INT3_Pos)
#define EIC_IDR_INT3_1              (EIC_IDR_INT3_1_Val            << EIC_IDR_INT3_Pos)
#define EIC_IDR_INT4_Pos            4            /**< \brief (EIC_IDR) External Interrupt 4 */
#define EIC_IDR_INT4                (_U(0x1) << EIC_IDR_INT4_Pos)
#define   EIC_IDR_INT4_0_Val              _U(0x0)   /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT4_1_Val              _U(0x1)   /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT4_0              (EIC_IDR_INT4_0_Val            << EIC_IDR_INT4_Pos)
#define EIC_IDR_INT4_1              (EIC_IDR_INT4_1_Val            << EIC_IDR_INT4_Pos)
#define EIC_IDR_INT5_Pos            5            /**< \brief (EIC_IDR) External Interrupt 5 */
#define EIC_IDR_INT5                (_U(0x1) << EIC_IDR_INT5_Pos)
#define EIC_IDR_INT6_Pos            6            /**< \brief (EIC_IDR) External Interrupt 6 */
#define EIC_IDR_INT6                (_U(0x1) << EIC_IDR_INT6_Pos)
#define EIC_IDR_INT7_Pos            7            /**< \brief (EIC_IDR) External Interrupt 7 */
#define EIC_IDR_INT7                (_U(0x1) << EIC_IDR_INT7_Pos)
#define EIC_IDR_INT8_Pos            8            /**< \brief (EIC_IDR) External Interrupt 8 */
#define EIC_IDR_INT8                (_U(0x1) << EIC_IDR_INT8_Pos)
#define EIC_IDR_INT9_Pos            9            /**< \brief (EIC_IDR) External Interrupt 9 */
#define EIC_IDR_INT9                (_U(0x1) << EIC_IDR_INT9_Pos)
#define EIC_IDR_INT10_Pos           10           /**< \brief (EIC_IDR) External Interrupt 10 */
#define EIC_IDR_INT10               (_U(0x1) << EIC_IDR_INT10_Pos)
#define EIC_IDR_INT11_Pos           11           /**< \brief (EIC_IDR) External Interrupt 11 */
#define EIC_IDR_INT11               (_U(0x1) << EIC_IDR_INT11_Pos)
#define EIC_IDR_INT12_Pos           12           /**< \brief (EIC_IDR) External Interrupt 12 */
#define EIC_IDR_INT12               (_U(0x1) << EIC_IDR_INT12_Pos)
#define EIC_IDR_INT13_Pos           13           /**< \brief (EIC_IDR) External Interrupt 13 */
#define EIC_IDR_INT13               (_U(0x1) << EIC_IDR_INT13_Pos)
#define EIC_IDR_INT14_Pos           14           /**< \brief (EIC_IDR) External Interrupt 14 */
#define EIC_IDR_INT14               (_U(0x1) << EIC_IDR_INT14_Pos)
#define EIC_IDR_INT15_Pos           15           /**< \brief (EIC_IDR) External Interrupt 15 */
#define EIC_IDR_INT15               (_U(0x1) << EIC_IDR_INT15_Pos)
#define EIC_IDR_MASK                _U(0x0000FFFF) /**< \brief (EIC_IDR) MASK Register */

/* -------- EIC_IMR : (EIC Offset: 0x008) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NMI:1;            /*!< bit:      0  External Non Maskable CPU interrupt */
    uint32_t INT1:1;           /*!< bit:      1  External Interrupt 1               */
    uint32_t INT2:1;           /*!< bit:      2  External Interrupt 2               */
    uint32_t INT3:1;           /*!< bit:      3  External Interrupt 3               */
    uint32_t INT4:1;           /*!< bit:      4  External Interrupt 4               */
    uint32_t INT5:1;           /*!< bit:      5  External Interrupt 5               */
    uint32_t INT6:1;           /*!< bit:      6  External Interrupt 6               */
    uint32_t INT7:1;           /*!< bit:      7  External Interrupt 7               */
    uint32_t INT8:1;           /*!< bit:      8  External Interrupt 8               */
    uint32_t INT9:1;           /*!< bit:      9  External Interrupt 9               */
    uint32_t INT10:1;          /*!< bit:     10  External Interrupt 10              */
    uint32_t INT11:1;          /*!< bit:     11  External Interrupt 11              */
    uint32_t INT12:1;          /*!< bit:     12  External Interrupt 12              */
    uint32_t INT13:1;          /*!< bit:     13  External Interrupt 13              */
    uint32_t INT14:1;          /*!< bit:     14  External Interrupt 14              */
    uint32_t INT15:1;          /*!< bit:     15  External Interrupt 15              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} EIC_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_IMR_OFFSET              0x008        /**< \brief (EIC_IMR offset) Interrupt Mask Register */
#define EIC_IMR_RESETVALUE          _U(0x00000000); /**< \brief (EIC_IMR reset_value) Interrupt Mask Register */

#define EIC_IMR_NMI_Pos             0            /**< \brief (EIC_IMR) External Non Maskable CPU interrupt */
#define EIC_IMR_NMI                 (_U(0x1) << EIC_IMR_NMI_Pos)
#define EIC_IMR_INT1_Pos            1            /**< \brief (EIC_IMR) External Interrupt 1 */
#define EIC_IMR_INT1                (_U(0x1) << EIC_IMR_INT1_Pos)
#define   EIC_IMR_INT1_0_Val              _U(0x0)   /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT1_1_Val              _U(0x1)   /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT1_0              (EIC_IMR_INT1_0_Val            << EIC_IMR_INT1_Pos)
#define EIC_IMR_INT1_1              (EIC_IMR_INT1_1_Val            << EIC_IMR_INT1_Pos)
#define EIC_IMR_INT2_Pos            2            /**< \brief (EIC_IMR) External Interrupt 2 */
#define EIC_IMR_INT2                (_U(0x1) << EIC_IMR_INT2_Pos)
#define   EIC_IMR_INT2_0_Val              _U(0x0)   /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT2_1_Val              _U(0x1)   /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT2_0              (EIC_IMR_INT2_0_Val            << EIC_IMR_INT2_Pos)
#define EIC_IMR_INT2_1              (EIC_IMR_INT2_1_Val            << EIC_IMR_INT2_Pos)
#define EIC_IMR_INT3_Pos            3            /**< \brief (EIC_IMR) External Interrupt 3 */
#define EIC_IMR_INT3                (_U(0x1) << EIC_IMR_INT3_Pos)
#define   EIC_IMR_INT3_0_Val              _U(0x0)   /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT3_1_Val              _U(0x1)   /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT3_0              (EIC_IMR_INT3_0_Val            << EIC_IMR_INT3_Pos)
#define EIC_IMR_INT3_1              (EIC_IMR_INT3_1_Val            << EIC_IMR_INT3_Pos)
#define EIC_IMR_INT4_Pos            4            /**< \brief (EIC_IMR) External Interrupt 4 */
#define EIC_IMR_INT4                (_U(0x1) << EIC_IMR_INT4_Pos)
#define   EIC_IMR_INT4_0_Val              _U(0x0)   /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT4_1_Val              _U(0x1)   /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT4_0              (EIC_IMR_INT4_0_Val            << EIC_IMR_INT4_Pos)
#define EIC_IMR_INT4_1              (EIC_IMR_INT4_1_Val            << EIC_IMR_INT4_Pos)
#define EIC_IMR_INT5_Pos            5            /**< \brief (EIC_IMR) External Interrupt 5 */
#define EIC_IMR_INT5                (_U(0x1) << EIC_IMR_INT5_Pos)
#define EIC_IMR_INT6_Pos            6            /**< \brief (EIC_IMR) External Interrupt 6 */
#define EIC_IMR_INT6                (_U(0x1) << EIC_IMR_INT6_Pos)
#define EIC_IMR_INT7_Pos            7            /**< \brief (EIC_IMR) External Interrupt 7 */
#define EIC_IMR_INT7                (_U(0x1) << EIC_IMR_INT7_Pos)
#define EIC_IMR_INT8_Pos            8            /**< \brief (EIC_IMR) External Interrupt 8 */
#define EIC_IMR_INT8                (_U(0x1) << EIC_IMR_INT8_Pos)
#define EIC_IMR_INT9_Pos            9            /**< \brief (EIC_IMR) External Interrupt 9 */
#define EIC_IMR_INT9                (_U(0x1) << EIC_IMR_INT9_Pos)
#define EIC_IMR_INT10_Pos           10           /**< \brief (EIC_IMR) External Interrupt 10 */
#define EIC_IMR_INT10               (_U(0x1) << EIC_IMR_INT10_Pos)
#define EIC_IMR_INT11_Pos           11           /**< \brief (EIC_IMR) External Interrupt 11 */
#define EIC_IMR_INT11               (_U(0x1) << EIC_IMR_INT11_Pos)
#define EIC_IMR_INT12_Pos           12           /**< \brief (EIC_IMR) External Interrupt 12 */
#define EIC_IMR_INT12               (_U(0x1) << EIC_IMR_INT12_Pos)
#define EIC_IMR_INT13_Pos           13           /**< \brief (EIC_IMR) External Interrupt 13 */
#define EIC_IMR_INT13               (_U(0x1) << EIC_IMR_INT13_Pos)
#define EIC_IMR_INT14_Pos           14           /**< \brief (EIC_IMR) External Interrupt 14 */
#define EIC_IMR_INT14               (_U(0x1) << EIC_IMR_INT14_Pos)
#define EIC_IMR_INT15_Pos           15           /**< \brief (EIC_IMR) External Interrupt 15 */
#define EIC_IMR_INT15               (_U(0x1) << EIC_IMR_INT15_Pos)
#define EIC_IMR_MASK                _U(0x0000FFFF) /**< \brief (EIC_IMR) MASK Register */

/* -------- EIC_ISR : (EIC Offset: 0x00C) (R/  32) Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NMI:1;            /*!< bit:      0  External Non Maskable CPU interrupt */
    uint32_t INT1:1;           /*!< bit:      1  External Interrupt 1               */
    uint32_t INT2:1;           /*!< bit:      2  External Interrupt 2               */
    uint32_t INT3:1;           /*!< bit:      3  External Interrupt 3               */
    uint32_t INT4:1;           /*!< bit:      4  External Interrupt 4               */
    uint32_t INT5:1;           /*!< bit:      5  External Interrupt 5               */
    uint32_t INT6:1;           /*!< bit:      6  External Interrupt 6               */
    uint32_t INT7:1;           /*!< bit:      7  External Interrupt 7               */
    uint32_t INT8:1;           /*!< bit:      8  External Interrupt 8               */
    uint32_t INT9:1;           /*!< bit:      9  External Interrupt 9               */
    uint32_t INT10:1;          /*!< bit:     10  External Interrupt 10              */
    uint32_t INT11:1;          /*!< bit:     11  External Interrupt 11              */
    uint32_t INT12:1;          /*!< bit:     12  External Interrupt 12              */
    uint32_t INT13:1;          /*!< bit:     13  External Interrupt 13              */
    uint32_t INT14:1;          /*!< bit:     14  External Interrupt 14              */
    uint32_t INT15:1;          /*!< bit:     15  External Interrupt 15              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} EIC_ISR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_ISR_OFFSET              0x00C        /**< \brief (EIC_ISR offset) Interrupt Status Register */
#define EIC_ISR_RESETVALUE          _U(0x00000000); /**< \brief (EIC_ISR reset_value) Interrupt Status Register */

