frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/eic.h
#define EIC_ICR_OFFSET              0x010        /**< \brief (EIC_ICR offset) Interrupt Clear Register */
#define EIC_ICR_RESETVALUE          _U(0x00000000); /**< \brief (EIC_ICR reset_value) Interrupt Clear Register */

#define EIC_ICR_NMI_Pos             0            /**< \brief (EIC_ICR) External Non Maskable CPU interrupt */
#define EIC_ICR_NMI                 (_U(0x1) << EIC_ICR_NMI_Pos)
#define EIC_ICR_INT1_Pos            1            /**< \brief (EIC_ICR) External Interrupt 1 */
#define EIC_ICR_INT1                (_U(0x1) << EIC_ICR_INT1_Pos)
#define   EIC_ICR_INT1_0_Val              _U(0x0)   /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT1_1_Val              _U(0x1)   /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT1_0              (EIC_ICR_INT1_0_Val            << EIC_ICR_INT1_Pos)
#define EIC_ICR_INT1_1              (EIC_ICR_INT1_1_Val            << EIC_ICR_INT1_Pos)
#define EIC_ICR_INT2_Pos            2            /**< \brief (EIC_ICR) External Interrupt 2 */
#define EIC_ICR_INT2                (_U(0x1) << EIC_ICR_INT2_Pos)
#define   EIC_ICR_INT2_0_Val              _U(0x0)   /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT2_1_Val              _U(0x1)   /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT2_0              (EIC_ICR_INT2_0_Val            << EIC_ICR_INT2_Pos)
#define EIC_ICR_INT2_1              (EIC_ICR_INT2_1_Val            << EIC_ICR_INT2_Pos)
#define EIC_ICR_INT3_Pos            3            /**< \brief (EIC_ICR) External Interrupt 3 */
#define EIC_ICR_INT3                (_U(0x1) << EIC_ICR_INT3_Pos)
#define   EIC_ICR_INT3_0_Val              _U(0x0)   /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT3_1_Val              _U(0x1)   /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT3_0              (EIC_ICR_INT3_0_Val            << EIC_ICR_INT3_Pos)
#define EIC_ICR_INT3_1              (EIC_ICR_INT3_1_Val            << EIC_ICR_INT3_Pos)
#define EIC_ICR_INT4_Pos            4            /**< \brief (EIC_ICR) External Interrupt 4 */
#define EIC_ICR_INT4                (_U(0x1) << EIC_ICR_INT4_Pos)
#define   EIC_ICR_INT4_0_Val              _U(0x0)   /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT4_1_Val              _U(0x1)   /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT4_0              (EIC_ICR_INT4_0_Val            << EIC_ICR_INT4_Pos)
#define EIC_ICR_INT4_1              (EIC_ICR_INT4_1_Val            << EIC_ICR_INT4_Pos)
#define EIC_ICR_INT5_Pos            5            /**< \brief (EIC_ICR) External Interrupt 5 */
#define EIC_ICR_INT5                (_U(0x1) << EIC_ICR_INT5_Pos)
#define EIC_ICR_INT6_Pos            6            /**< \brief (EIC_ICR) External Interrupt 6 */
#define EIC_ICR_INT6                (_U(0x1) << EIC_ICR_INT6_Pos)
#define EIC_ICR_INT7_Pos            7            /**< \brief (EIC_ICR) External Interrupt 7 */
#define EIC_ICR_INT7                (_U(0x1) << EIC_ICR_INT7_Pos)
#define EIC_ICR_INT8_Pos            8            /**< \brief (EIC_ICR) External Interrupt 8 */
#define EIC_ICR_INT8                (_U(0x1) << EIC_ICR_INT8_Pos)
#define EIC_ICR_INT9_Pos            9            /**< \brief (EIC_ICR) External Interrupt 9 */
#define EIC_ICR_INT9                (_U(0x1) << EIC_ICR_INT9_Pos)
#define EIC_ICR_INT10_Pos           10           /**< \brief (EIC_ICR) External Interrupt 10 */
#define EIC_ICR_INT10               (_U(0x1) << EIC_ICR_INT10_Pos)
#define EIC_ICR_INT11_Pos           11           /**< \brief (EIC_ICR) External Interrupt 11 */
#define EIC_ICR_INT11               (_U(0x1) << EIC_ICR_INT11_Pos)
#define EIC_ICR_INT12_Pos           12           /**< \brief (EIC_ICR) External Interrupt 12 */
#define EIC_ICR_INT12               (_U(0x1) << EIC_ICR_INT12_Pos)
#define EIC_ICR_INT13_Pos           13           /**< \brief (EIC_ICR) External Interrupt 13 */
#define EIC_ICR_INT13               (_U(0x1) << EIC_ICR_INT13_Pos)
#define EIC_ICR_INT14_Pos           14           /**< \brief (EIC_ICR) External Interrupt 14 */
#define EIC_ICR_INT14               (_U(0x1) << EIC_ICR_INT14_Pos)
#define EIC_ICR_INT15_Pos           15           /**< \brief (EIC_ICR) External Interrupt 15 */
#define EIC_ICR_INT15               (_U(0x1) << EIC_ICR_INT15_Pos)
#define EIC_ICR_MASK                _U(0x0000FFFF) /**< \brief (EIC_ICR) MASK Register */

/* -------- EIC_MODE : (EIC Offset: 0x014) (R/W 32) Mode Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NMI:1;            /*!< bit:      0  External Non Maskable CPU interrupt */
    uint32_t INT1:1;           /*!< bit:      1  External Interrupt 1               */
    uint32_t INT2:1;           /*!< bit:      2  External Interrupt 2               */
    uint32_t INT3:1;           /*!< bit:      3  External Interrupt 3               */
    uint32_t INT4:1;           /*!< bit:      4  External Interrupt 4               */
    uint32_t INT5:1;           /*!< bit:      5  External Interrupt 5               */
    uint32_t INT6:1;           /*!< bit:      6  External Interrupt 6               */
    uint32_t INT7:1;           /*!< bit:      7  External Interrupt 7               */
    uint32_t INT8:1;           /*!< bit:      8  External Interrupt 8               */
    uint32_t INT9:1;           /*!< bit:      9  External Interrupt 9               */
    uint32_t INT10:1;          /*!< bit:     10  External Interrupt 10              */
    uint32_t INT11:1;          /*!< bit:     11  External Interrupt 11              */
    uint32_t INT12:1;          /*!< bit:     12  External Interrupt 12              */
    uint32_t INT13:1;          /*!< bit:     13  External Interrupt 13              */
    uint32_t INT14:1;          /*!< bit:     14  External Interrupt 14              */
    uint32_t INT15:1;          /*!< bit:     15  External Interrupt 15              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} EIC_MODE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_MODE_OFFSET             0x014        /**< \brief (EIC_MODE offset) Mode Register */
#define EIC_MODE_RESETVALUE         _U(0x00000000); /**< \brief (EIC_MODE reset_value) Mode Register */

#define EIC_MODE_NMI_Pos            0            /**< \brief (EIC_MODE) External Non Maskable CPU interrupt */
#define EIC_MODE_NMI                (_U(0x1) << EIC_MODE_NMI_Pos)
#define EIC_MODE_INT1_Pos           1            /**< \brief (EIC_MODE) External Interrupt 1 */
#define EIC_MODE_INT1               (_U(0x1) << EIC_MODE_INT1_Pos)
#define   EIC_MODE_INT1_0_Val             _U(0x0)   /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT1_1_Val             _U(0x1)   /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT1_0             (EIC_MODE_INT1_0_Val           << EIC_MODE_INT1_Pos)
#define EIC_MODE_INT1_1             (EIC_MODE_INT1_1_Val           << EIC_MODE_INT1_Pos)
#define EIC_MODE_INT2_Pos           2            /**< \brief (EIC_MODE) External Interrupt 2 */
#define EIC_MODE_INT2               (_U(0x1) << EIC_MODE_INT2_Pos)
#define   EIC_MODE_INT2_0_Val             _U(0x0)   /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT2_1_Val             _U(0x1)   /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT2_0             (EIC_MODE_INT2_0_Val           << EIC_MODE_INT2_Pos)
#define EIC_MODE_INT2_1             (EIC_MODE_INT2_1_Val           << EIC_MODE_INT2_Pos)
#define EIC_MODE_INT3_Pos           3            /**< \brief (EIC_MODE) External Interrupt 3 */
#define EIC_MODE_INT3               (_U(0x1) << EIC_MODE_INT3_Pos)
#define   EIC_MODE_INT3_0_Val             _U(0x0)   /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT3_1_Val             _U(0x1)   /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT3_0             (EIC_MODE_INT3_0_Val           << EIC_MODE_INT3_Pos)
#define EIC_MODE_INT3_1             (EIC_MODE_INT3_1_Val           << EIC_MODE_INT3_Pos)
#define EIC_MODE_INT4_Pos           4            /**< \brief (EIC_MODE) External Interrupt 4 */
#define EIC_MODE_INT4               (_U(0x1) << EIC_MODE_INT4_Pos)
#define   EIC_MODE_INT4_0_Val             _U(0x0)   /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT4_1_Val             _U(0x1)   /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT4_0             (EIC_MODE_INT4_0_Val           << EIC_MODE_INT4_Pos)
#define EIC_MODE_INT4_1             (EIC_MODE_INT4_1_Val           << EIC_MODE_INT4_Pos)
#define EIC_MODE_INT5_Pos           5            /**< \brief (EIC_MODE) External Interrupt 5 */
#define EIC_MODE_INT5               (_U(0x1) << EIC_MODE_INT5_Pos)
#define EIC_MODE_INT6_Pos           6            /**< \brief (EIC_MODE) External Interrupt 6 */
#define EIC_MODE_INT6               (_U(0x1) << EIC_MODE_INT6_Pos)
#define EIC_MODE_INT7_Pos           7            /**< \brief (EIC_MODE) External Interrupt 7 */
#define EIC_MODE_INT7               (_U(0x1) << EIC_MODE_INT7_Pos)
#define EIC_MODE_INT8_Pos           8            /**< \brief (EIC_MODE) External Interrupt 8 */
#define EIC_MODE_INT8               (_U(0x1) << EIC_MODE_INT8_Pos)
#define EIC_MODE_INT9_Pos           9            /**< \brief (EIC_MODE) External Interrupt 9 */
#define EIC_MODE_INT9               (_U(0x1) << EIC_MODE_INT9_Pos)
#define EIC_MODE_INT10_Pos          10           /**< \brief (EIC_MODE) External Interrupt 10 */
#define EIC_MODE_INT10              (_U(0x1) << EIC_MODE_INT10_Pos)
#define EIC_MODE_INT11_Pos          11           /**< \brief (EIC_MODE) External Interrupt 11 */
#define EIC_MODE_INT11              (_U(0x1) << EIC_MODE_INT11_Pos)
#define EIC_MODE_INT12_Pos          12           /**< \brief (EIC_MODE) External Interrupt 12 */
#define EIC_MODE_INT12              (_U(0x1) << EIC_MODE_INT12_Pos)
#define EIC_MODE_INT13_Pos          13           /**< \brief (EIC_MODE) External Interrupt 13 */
#define EIC_MODE_INT13              (_U(0x1) << EIC_MODE_INT13_Pos)
#define EIC_MODE_INT14_Pos          14           /**< \brief (EIC_MODE) External Interrupt 14 */
#define EIC_MODE_INT14              (_U(0x1) << EIC_MODE_INT14_Pos)
#define EIC_MODE_INT15_Pos          15           /**< \brief (EIC_MODE) External Interrupt 15 */
#define EIC_MODE_INT15              (_U(0x1) << EIC_MODE_INT15_Pos)
#define EIC_MODE_MASK               _U(0x0000FFFF) /**< \brief (EIC_MODE) MASK Register */

/* -------- EIC_EDGE : (EIC Offset: 0x018) (R/W 32) Edge Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NMI:1;            /*!< bit:      0  External Non Maskable CPU interrupt */
    uint32_t INT1:1;           /*!< bit:      1  External Interrupt 1               */
    uint32_t INT2:1;           /*!< bit:      2  External Interrupt 2               */
    uint32_t INT3:1;           /*!< bit:      3  External Interrupt 3               */
    uint32_t INT4:1;           /*!< bit:      4  External Interrupt 4               */
    uint32_t INT5:1;           /*!< bit:      5  External Interrupt 5               */
    uint32_t INT6:1;           /*!< bit:      6  External Interrupt 6               */
    uint32_t INT7:1;           /*!< bit:      7  External Interrupt 7               */
    uint32_t INT8:1;           /*!< bit:      8  External Interrupt 8               */
    uint32_t INT9:1;           /*!< bit:      9  External Interrupt 9               */
    uint32_t INT10:1;          /*!< bit:     10  External Interrupt 10              */
    uint32_t INT11:1;          /*!< bit:     11  External Interrupt 11              */
    uint32_t INT12:1;          /*!< bit:     12  External Interrupt 12              */
    uint32_t INT13:1;          /*!< bit:     13  External Interrupt 13              */
    uint32_t INT14:1;          /*!< bit:     14  External Interrupt 14              */
    uint32_t INT15:1;          /*!< bit:     15  External Interrupt 15              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} EIC_EDGE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

