frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/eic.h
#define EIC_EDGE_OFFSET             0x018        /**< \brief (EIC_EDGE offset) Edge Register */
#define EIC_EDGE_RESETVALUE         _U(0x00000000); /**< \brief (EIC_EDGE reset_value) Edge Register */

#define EIC_EDGE_NMI_Pos            0            /**< \brief (EIC_EDGE) External Non Maskable CPU interrupt */
#define EIC_EDGE_NMI                (_U(0x1) << EIC_EDGE_NMI_Pos)
#define EIC_EDGE_INT1_Pos           1            /**< \brief (EIC_EDGE) External Interrupt 1 */
#define EIC_EDGE_INT1               (_U(0x1) << EIC_EDGE_INT1_Pos)
#define   EIC_EDGE_INT1_0_Val             _U(0x0)   /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT1_1_Val             _U(0x1)   /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT1_0             (EIC_EDGE_INT1_0_Val           << EIC_EDGE_INT1_Pos)
#define EIC_EDGE_INT1_1             (EIC_EDGE_INT1_1_Val           << EIC_EDGE_INT1_Pos)
#define EIC_EDGE_INT2_Pos           2            /**< \brief (EIC_EDGE) External Interrupt 2 */
#define EIC_EDGE_INT2               (_U(0x1) << EIC_EDGE_INT2_Pos)
#define   EIC_EDGE_INT2_0_Val             _U(0x0)   /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT2_1_Val             _U(0x1)   /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT2_0             (EIC_EDGE_INT2_0_Val           << EIC_EDGE_INT2_Pos)
#define EIC_EDGE_INT2_1             (EIC_EDGE_INT2_1_Val           << EIC_EDGE_INT2_Pos)
#define EIC_EDGE_INT3_Pos           3            /**< \brief (EIC_EDGE) External Interrupt 3 */
#define EIC_EDGE_INT3               (_U(0x1) << EIC_EDGE_INT3_Pos)
#define   EIC_EDGE_INT3_0_Val             _U(0x0)   /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT3_1_Val             _U(0x1)   /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT3_0             (EIC_EDGE_INT3_0_Val           << EIC_EDGE_INT3_Pos)
#define EIC_EDGE_INT3_1             (EIC_EDGE_INT3_1_Val           << EIC_EDGE_INT3_Pos)
#define EIC_EDGE_INT4_Pos           4            /**< \brief (EIC_EDGE) External Interrupt 4 */
#define EIC_EDGE_INT4               (_U(0x1) << EIC_EDGE_INT4_Pos)
#define   EIC_EDGE_INT4_0_Val             _U(0x0)   /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT4_1_Val             _U(0x1)   /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT4_0             (EIC_EDGE_INT4_0_Val           << EIC_EDGE_INT4_Pos)
#define EIC_EDGE_INT4_1             (EIC_EDGE_INT4_1_Val           << EIC_EDGE_INT4_Pos)
#define EIC_EDGE_INT5_Pos           5            /**< \brief (EIC_EDGE) External Interrupt 5 */
#define EIC_EDGE_INT5               (_U(0x1) << EIC_EDGE_INT5_Pos)
#define EIC_EDGE_INT6_Pos           6            /**< \brief (EIC_EDGE) External Interrupt 6 */
#define EIC_EDGE_INT6               (_U(0x1) << EIC_EDGE_INT6_Pos)
#define EIC_EDGE_INT7_Pos           7            /**< \brief (EIC_EDGE) External Interrupt 7 */
#define EIC_EDGE_INT7               (_U(0x1) << EIC_EDGE_INT7_Pos)
#define EIC_EDGE_INT8_Pos           8            /**< \brief (EIC_EDGE) External Interrupt 8 */
#define EIC_EDGE_INT8               (_U(0x1) << EIC_EDGE_INT8_Pos)
#define EIC_EDGE_INT9_Pos           9            /**< \brief (EIC_EDGE) External Interrupt 9 */
#define EIC_EDGE_INT9               (_U(0x1) << EIC_EDGE_INT9_Pos)
#define EIC_EDGE_INT10_Pos          10           /**< \brief (EIC_EDGE) External Interrupt 10 */
#define EIC_EDGE_INT10              (_U(0x1) << EIC_EDGE_INT10_Pos)
#define EIC_EDGE_INT11_Pos          11           /**< \brief (EIC_EDGE) External Interrupt 11 */
#define EIC_EDGE_INT11              (_U(0x1) << EIC_EDGE_INT11_Pos)
#define EIC_EDGE_INT12_Pos          12           /**< \brief (EIC_EDGE) External Interrupt 12 */
#define EIC_EDGE_INT12              (_U(0x1) << EIC_EDGE_INT12_Pos)
#define EIC_EDGE_INT13_Pos          13           /**< \brief (EIC_EDGE) External Interrupt 13 */
#define EIC_EDGE_INT13              (_U(0x1) << EIC_EDGE_INT13_Pos)
#define EIC_EDGE_INT14_Pos          14           /**< \brief (EIC_EDGE) External Interrupt 14 */
#define EIC_EDGE_INT14              (_U(0x1) << EIC_EDGE_INT14_Pos)
#define EIC_EDGE_INT15_Pos          15           /**< \brief (EIC_EDGE) External Interrupt 15 */
#define EIC_EDGE_INT15              (_U(0x1) << EIC_EDGE_INT15_Pos)
#define EIC_EDGE_MASK               _U(0x0000FFFF) /**< \brief (EIC_EDGE) MASK Register */

/* -------- EIC_LEVEL : (EIC Offset: 0x01C) (R/W 32) Level Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NMI:1;            /*!< bit:      0  External Non Maskable CPU interrupt */
    uint32_t INT1:1;           /*!< bit:      1  External Interrupt 1               */
    uint32_t INT2:1;           /*!< bit:      2  External Interrupt 2               */
    uint32_t INT3:1;           /*!< bit:      3  External Interrupt 3               */
    uint32_t INT4:1;           /*!< bit:      4  External Interrupt 4               */
    uint32_t INT5:1;           /*!< bit:      5  External Interrupt 5               */
    uint32_t INT6:1;           /*!< bit:      6  External Interrupt 6               */
    uint32_t INT7:1;           /*!< bit:      7  External Interrupt 7               */
    uint32_t INT8:1;           /*!< bit:      8  External Interrupt 8               */
    uint32_t INT9:1;           /*!< bit:      9  External Interrupt 9               */
    uint32_t INT10:1;          /*!< bit:     10  External Interrupt 10              */
    uint32_t INT11:1;          /*!< bit:     11  External Interrupt 11              */
    uint32_t INT12:1;          /*!< bit:     12  External Interrupt 12              */
    uint32_t INT13:1;          /*!< bit:     13  External Interrupt 13              */
    uint32_t INT14:1;          /*!< bit:     14  External Interrupt 14              */
    uint32_t INT15:1;          /*!< bit:     15  External Interrupt 15              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} EIC_LEVEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_LEVEL_OFFSET            0x01C        /**< \brief (EIC_LEVEL offset) Level Register */
#define EIC_LEVEL_RESETVALUE        _U(0x00000000); /**< \brief (EIC_LEVEL reset_value) Level Register */

